<template>
  <div class="linework">
    <li v-for="(item, index1) in linework">
      <el-col :span="24">
        <el-menu default-active="2" class="el-menu-vertical-demo" @open="handleOpen" @close="handleClose" theme="">
          <el-submenu index="1">
            <template slot="title">
              <span class="ltitle">{{item.classname}}</span>
              <span class="rtitle">班级：{{item.class}}</span>
            </template>
            <el-menu-item :index="index" v-for="(it,index2) in item.day"
                          @click="workdetail('/linework/studentswork', index1, index2)" :key="1"><span
              class="ltitle">{{it.time}}</span><span class="rtitle">{{it.progress}}</span></el-menu-item>
          </el-submenu>
        </el-menu>
      </el-col>
    </li>
  </div>
</template>

<script type="text/ecmascript-6">
  export default {
    data(){
      return {
        linework: {},
        tlinework: [
          {
            'classname': '马克思主义',
            'class': '1-211',
            'day': [
              {
                'time': '2017-4-12 14:11',
                'progress': '6/22/30',
                'stu': [
                  {
                    'stuname': '林玉',
                    'time': '2017-4-12 15:33',
                    'question': '共产党宣言包含哪些内容？',
                    'rate': '8.8',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  },
                  {
                    'stuname': '何鑫',
                    'rate': '4.3',
                    'time': '2017-4-12 15:33',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  },
                  {
                    'stuname': '杨成才',
                    'time': '2017-4-12 16:33',
                    'rate': '10.0',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  },
                  {
                    'stuname': '颜如玉',
                    'time': '2017-4-12 17:33',
                    'rate': '',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  },
                  {
                    'stuname': '阿珂',
                    'time': '2017-4-12 15:53',
                    'rate': '4.3',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  },
                  {
                    'stuname': '亚瑟',
                    'time': '2017-4-12 15:50',
                    'rate': '4.3',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  }
                ]
              },
              {
                'time': '2017-4-16 14:11',
                'progress': '6/22/30',
                'stu': [
                  {
                    'stuname': '林玉',
                    'time': '2017-4-16 15:33',
                    'rate': '6.0',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  },
                  {
                    'stuname': '何鑫',
                    'time': '2017-4-16 15:33',
                    'rate': '7.7',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  },
                  {
                    'stuname': '杨成才',
                    'time': '2017-4-16 16:33',
                    'rate': '4.3',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  },
                  {
                    'stuname': '颜如玉',
                    'time': '2017-4-16 17:33',
                    'rate': '4.3',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  },
                  {
                    'stuname': '阿珂',
                    'time': '2017-4-16 15:53',
                    'rate': '',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  },
                  {
                    'stuname': '亚瑟',
                    'time': '2017-4-16 15:50',
                    'rate': '4.3',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  }
                ]
              },
              {
                'time': '2017-5-12 14:11',
                'progress': '6/22/30',
                'stu': [
                  {
                    'stuname': '林玉',
                    'time': '2017-5-12 15:33',
                    'rate': '4.3',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  },
                  {
                    'stuname': '何鑫',
                    'time': '2017-5-12 15:33',
                    'rate': '',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  },
                  {
                    'stuname': '杨成才',
                    'time': '2017-5-12 16:33',
                    'rate': '4.3',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  },
                  {
                    'stuname': '颜如玉',
                    'time': '2017-5-12 17:33',
                    'rate': '4.3',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  },
                  {
                    'stuname': '阿珂',
                    'time': '2017-5-12 15:53',
                    'rate': '4.3',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  },
                  {
                    'stuname': '亚瑟',
                    'time': '2017-5-12 15:50',
                    'rate': '',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  }
                ]
              }
            ]
          },
          {
            'classname': '马克思主义',
            'class': '1-226',
            'day': [
              {
                'time': '2017-4-12 14:11',
                'progress': '6/22/30',
                'stu': [
                  {
                    'stuname': '林玉',
                    'time': '2017-4-12 15:33',
                    'rate': '4.3',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  },
                  {
                    'stuname': '何鑫',
                    'time': '2017-4-12 15:33',
                    'rate': '4.3',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  },
                  {
                    'stuname': '杨成才',
                    'time': '2017-4-12 16:33',
                    'rate': '7.3',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  },
                  {
                    'stuname': '颜如玉',
                    'time': '2017-4-12 17:33',
                    'rate': '4.3',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  },
                  {
                    'stuname': '阿珂',
                    'time': '2017-4-12 15:53',
                    'rate': '',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  },
                  {
                    'stuname': '亚瑟',
                    'time': '2017-4-12 15:50',
                    'rate': '4.3',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  }
                ]
              },
              {
                'time': '2017-4-16 14:11',
                'progress': '6/22/30',
                'stu': [
                  {
                    'stuname': '林玉',
                    'time': '2017-4-16 15:33',
                    'rate': '6.3',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  },
                  {
                    'stuname': '何鑫',
                    'time': '2017-4-16 15:33',
                    'rate': '8.7',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  },
                  {
                    'stuname': '杨成才',
                    'time': '2017-4-16 16:33',
                    'rate': '4.3',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  },
                  {
                    'stuname': '颜如玉',
                    'time': '2017-4-16 17:33',
                    'rate': '4.3',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  },
                  {
                    'stuname': '阿珂',
                    'time': '2017-4-16 15:53',
                    'rate': '4.3',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  },
                  {
                    'stuname': '亚瑟',
                    'time': '2017-4-16 15:50',
                    'rate': '',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  }
                ]
              },
              {
                'time': '2017-5-12 14:11',
                'progress': '6/22/30',
                'stu': [
                  {
                    'stuname': '林玉',
                    'time': '2017-5-12 15:33',
                    'question': '共产党宣言包含哪些内容？',
                    'rate': '7.3',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  },
                  {
                    'stuname': '何鑫',
                    'time': '2017-5-12 15:33',
                    'rate': '8.3',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  },
                  {
                    'stuname': '杨成才',
                    'time': '2017-5-12 16:33',
                    'rate': '4.3',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  },
                  {
                    'stuname': '颜如玉',
                    'time': '2017-5-12 17:33',
                    'rate': '4.3',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  },
                  {
                    'stuname': '阿珂',
                    'time': '2017-5-12 15:53',
                    'rate': '',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  },
                  {
                    'stuname': '亚瑟',
                    'time': '2017-5-12 15:50',
                    'rate': '4.6',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  }
                ]
              }
            ]
          },
          {
            'classname': '共产党宣言',
            'class': '1-221',
            'day': [
              {
                'time': '2017-6-12 14:11',
                'progress': '6/22/30',
                'stu': [
                  {
                    'stuname': '林玉',
                    'time': '2017-6-12 15:33',
                    'rate': '4.3',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  },
                  {
                    'stuname': '何鑫',
                    'time': '2017-6-12 15:33',
                    'rate': '6.3',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  },
                  {
                    'stuname': '杨成才',
                    'time': '2017-6-12 16:33',
                    'rate': '4.3',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  },
                  {
                    'stuname': '颜如玉',
                    'time': '2017-6-12 17:33',
                    'rate': '',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  },
                  {
                    'stuname': '阿珂',
                    'time': '2017-6-12 15:53',
                    'rate': '4.3',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  },
                  {
                    'stuname': '亚瑟',
                    'time': '2017-6-12 15:50',
                    'rate': '4.9',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  }
                ]
              },
              {
                'time': '2017-4-12 14:11',
                'progress': '6/22/30',
                'stu': [
                  {
                    'stuname': '林玉',
                    'time': '2017-4-12 15:33',
                    'rate': '8.3',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  },
                  {
                    'stuname': '何鑫',
                    'time': '2017-4-12 15:33',
                    'rate': '4.3',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  },
                  {
                    'stuname': '杨成才',
                    'time': '2017-4-12 16:33',
                    'rate': '4.3',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  },
                  {
                    'stuname': '颜如玉',
                    'time': '2017-4-12 17:33',
                    'rate': '',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  },
                  {
                    'stuname': '阿珂',
                    'time': '2017-4-12 15:53',
                    'rate': '4.3',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  },
                  {
                    'stuname': '亚瑟',
                    'time': '2017-4-12 15:50',
                    'rate': '4.3',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  }
                ]
              },
              {
                'time': '2017-4-12 14:11',
                'progress': '6/22/30',
                'stu': [
                  {
                    'stuname': '林玉',
                    'time': '2017-4-12 15:33',
                    'rate': '',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  },
                  {
                    'stuname': '何鑫',
                    'time': '2017-4-12 15:33',
                    'rate': '4.3',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  },
                  {
                    'stuname': '杨成才',
                    'time': '2017-4-12 16:33',
                    'rate': '4.3',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  },
                  {
                    'stuname': '颜如玉',
                    'time': '2017-4-12 17:33',
                    'rate': '4.3',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  },
                  {
                    'stuname': '阿珂',
                    'time': '2017-4-12 15:53',
                    'rate': '4.3',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  },
                  {
                    'stuname': '亚瑟',
                    'time': '2017-4-12 15:50',
                    'rate': '4.3',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  }
                ]
              }
            ]
          }
        ]
      }
    },
    created(){
      document.body.style.backgroundColor = 'rgba(7,17,27,0.1)'
      this.linework = this.tlinework
    },
    methods: {
      handleOpen(key, keyPath) {
        console.log(key, keyPath)
      },
      handleClose(key, keyPath) {
        console.log(key, keyPath)
      },
      workdetail(name, index1, index2){
        this.$router.push({
          path: name,
          query: {index1: index1, index2: index2}
        })
      }
    }
  }
</script>

<style lang="stylus" type="text/stylus">
  @import '../common/css/myleave.styl'
</style>
