<template>
  <div class="workdetail">
    <div class="workdetail-question">{{time.question}}</div>
    <div class="workdetail-answer" v-if="time.answer"><span class="workdetail-color">答：</span>{{time.answer}}</div>
    <textarea class="workdetail-answer" v-else></textarea>
    <div class="workdetail-evaluate" v-if="time.evaluate"><span class="workdetail-color">老师批复：</span>{{time.evaluate}}
    </div>
    <div class="workdetail-evaluate" v-else><span class="workdetail-color">老师批复：</span>
      <textarea class="workdetail-answer" style="min-height: 60px"></textarea>
    </div>
    <!--<div class="workdetail-evaluate" v-if="time.rate"><span class="workdetail-color">老师评分：</span>{{time.rate}}</div>-->
    <div class="workdetail-evaluate"><span class="workdetail-color">老师评分：</span><input v-model="time.rate"
                                                                                       style="width: 30px"
                                                                                       type="text">分
    </div>
    <div class="workdetail-sub" style="background-color: #8b0000">
      <!--<router-link to="'/linework/studentswork?index1='+'$route.query.index1'+'index2='+'$route.query.index2'" style="color: white">完成</router-link>-->
      <div @click="workback('/linework/studentswork', $route.query.index1, $route.query.index2)" style="color: white">
        完成
      </div>
    </div>
  </div>
</template>

<script type="text/ecmascript-6">
  export default{
    data(){
      return {
        time: {},
        linework: [
          {
            'time': [
              {
                'state': '1',
                'evaluate': '言简意赅，思路清晰',
                'rate': '9.0',
                'day': '2017-1-3',
                'question': '共产党宣言包含哪些内容？',
                'anwser': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
              },
              {
                'state': '1',
                'day': '2017-1-3',
                'evaluate': '言简意赅，思路清晰',
                'rate': '6.9',
                'question': '共产党宣言的本质？',
                'anwser': '《共产党宣言》运用了辩证唯物主义和历史唯物主义分析生产力与生产关系、经济基础与上层建筑的矛盾，分析阶级和阶级斗争，特别是资本主义社会阶级斗争的产生、发展过程，论证资本主义必然灭亡和社会主义必然胜利的客观规律，作为资本主义掘墓人的无产阶级肩负的世界历史使命。'
              },
              {
                'state': '1',
                'evaluate': '言简意赅，思路清晰',
                'rate': '5.5',
                'day': '2017-1-3',
                'question': '对于共产党宣言，你的理解是？',
                'anwser': '。《共产党宣言》还指出无产阶级在夺取政权后，必须在大力发展生产力的基础上，逐步地进行巨大的社会改造，进而达到消灭阶级对立和阶级本身的存在条件。《共产党宣言》批判当时各种反动的社会主义思潮，对空想社会主义作了科学的分析和评价。《共产党宣言》阐述作为无产阶级先进队伍的共产党的性质、特点和斗争策略，指出为党的目的而奋斗与争取实现共产主义终极目的之间的联系。'
              },
              {
                'state': '',
                'day': '2017-1-3',
                'rate': '',
                'evaluate': '',
                'question': '聊一聊共产党宣言的前世今生。',
                'anwser': ''
              },
              {
                'state': '',
                'evaluate': '',
                'rate': '',
                'day': '2017-1-3',
                'question': '共产党宣言包含哪些内容？',
                'anwser': ''
              }
            ],
            'class': '共产党宣言'
          },
          {
            'time': [
              {
                'state': '1',
                'evaluate': '言简意赅，思路清晰',
                'rate': '8.5',
                'day': '2017-2-3',
                'question': '三个代表的重要思想包含哪些内容？',
                'anwser': '具体内容为中国共产党始终代表中国先进生产力的发展要求、中国先进文化的前进方向、中国最广大人民的根本利益，是我们党的立党之本、执政之基、力量之源。 “三个代表”重要思想，集中概括了党和国家全部理论活动、实践活动，包括一切工作的根本方向、根本准则、根本依据，成为指引党和国家新世纪伟大进军的行动指南。'
              },
              {
                'state': '1',
                'evaluate': '逻辑清楚',
                'rate': '5.5',
                'day': '2017-3-13',
                'question': '三个代表的重要思想带来的启示？',
                'anwser': '三个代表”重要思想，集中概括了党和国家全部理论活动、实践活动，包括一切工作的根本方向、根本准则、根本依据，成为指引党和国家新世纪伟大进军的行动指南。 “三个代表”重要思想是面向21世纪的中国化的马克思主义，是新世纪新阶段全党全国人民继往开来、与时俱进，实现全面建设小康社会宏伟目标的根本指针。'
              }
            ],
            'class': '三个代表思想'
          },
          {
            'time': [
              {
                'state': '1',
                'evaluate': '言简意赅，思路清晰',
                'rate': '9.5',
                'day': '2017-2-3',
                'question': '马克思主义哲学包含哪些内容？',
                'anwser': '辩证的唯物论，唯物的辩证法，辩证唯物主义的认识论，历史唯物论'
              },
              {
                'state': '',
                'day': '2017-3-13',
                'rate': '',
                'evaluate': '',
                'question': '马克思主义的起源',
                'anwser': '马克思主义有三部分组成：一是马克思主义哲学,它的理论来源是德国古典学,其中的代表是黑格尔的唯心主义辩证法和费尔巴哈的唯物主义。二是马克思主义政治经济学,其直接来源是古典政治经济学,其中的代表人物是亚当斯密和大卫~李嘉图的劳动创造价值。三是科学社会主义：其来源是19实际欧洲空想社会主义学说,其代表人是西门,傅立叶,欧文。'
              }
            ],
            'class': '马克思主义哲学'
          }
        ],
        tlinework: [
          {
            'classname': '马克思主义',
            'class': '1-211',
            'day': [
              {
                'time': '2017-4-12 14:11',
                'progress': '6/22/30',
                'stu': [
                  {
                    'stuname': '林玉',
                    'time': '2017-4-12 15:33',
                    'question': '共产党宣言包含哪些内容？',
                    'rate': '8.8',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  },
                  {
                    'stuname': '何鑫',
                    'rate': '4.3',
                    'time': '2017-4-12 15:33',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  },
                  {
                    'stuname': '杨成才',
                    'time': '2017-4-12 16:33',
                    'rate': '10.0',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  },
                  {
                    'stuname': '颜如玉',
                    'time': '2017-4-12 17:33',
                    'rate': '',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  },
                  {
                    'stuname': '阿珂',
                    'time': '2017-4-12 15:53',
                    'rate': '4.3',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  },
                  {
                    'stuname': '亚瑟',
                    'time': '2017-4-12 15:50',
                    'rate': '4.3',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  }
                ]
              },
              {
                'time': '2017-4-16 14:11',
                'progress': '6/22/30',
                'stu': [
                  {
                    'stuname': '林玉',
                    'time': '2017-4-16 15:33',
                    'rate': '6.0',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  },
                  {
                    'stuname': '何鑫',
                    'time': '2017-4-16 15:33',
                    'rate': '7.7',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  },
                  {
                    'stuname': '杨成才',
                    'time': '2017-4-16 16:33',
                    'rate': '4.3',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  },
                  {
                    'stuname': '颜如玉',
                    'time': '2017-4-16 17:33',
                    'rate': '4.3',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  },
                  {
                    'stuname': '阿珂',
                    'time': '2017-4-16 15:53',
                    'rate': '',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  },
                  {
                    'stuname': '亚瑟',
                    'time': '2017-4-16 15:50',
                    'rate': '4.3',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  }
                ]
              },
              {
                'time': '2017-5-12 14:11',
                'progress': '6/22/30',
                'stu': [
                  {
                    'stuname': '林玉',
                    'time': '2017-5-12 15:33',
                    'rate': '4.3',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  },
                  {
                    'stuname': '何鑫',
                    'time': '2017-5-12 15:33',
                    'rate': '',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  },
                  {
                    'stuname': '杨成才',
                    'time': '2017-5-12 16:33',
                    'rate': '4.3',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  },
                  {
                    'stuname': '颜如玉',
                    'time': '2017-5-12 17:33',
                    'rate': '4.3',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  },
                  {
                    'stuname': '阿珂',
                    'time': '2017-5-12 15:53',
                    'rate': '4.3',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  },
                  {
                    'stuname': '亚瑟',
                    'time': '2017-5-12 15:50',
                    'rate': '',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  }
                ]
              }
            ]
          },
          {
            'classname': '马克思主义',
            'class': '1-226',
            'day': [
              {
                'time': '2017-4-12 14:11',
                'progress': '6/22/30',
                'stu': [
                  {
                    'stuname': '林玉',
                    'time': '2017-4-12 15:33',
                    'rate': '4.3',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  },
                  {
                    'stuname': '何鑫',
                    'time': '2017-4-12 15:33',
                    'rate': '4.3',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  },
                  {
                    'stuname': '杨成才',
                    'time': '2017-4-12 16:33',
                    'rate': '7.3',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  },
                  {
                    'stuname': '颜如玉',
                    'time': '2017-4-12 17:33',
                    'rate': '4.3',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  },
                  {
                    'stuname': '阿珂',
                    'time': '2017-4-12 15:53',
                    'rate': '',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  },
                  {
                    'stuname': '亚瑟',
                    'time': '2017-4-12 15:50',
                    'rate': '4.3',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  }
                ]
              },
              {
                'time': '2017-4-16 14:11',
                'progress': '6/22/30',
                'stu': [
                  {
                    'stuname': '林玉',
                    'time': '2017-4-16 15:33',
                    'rate': '6.3',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  },
                  {
                    'stuname': '何鑫',
                    'time': '2017-4-16 15:33',
                    'rate': '8.7',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  },
                  {
                    'stuname': '杨成才',
                    'time': '2017-4-16 16:33',
                    'rate': '4.3',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  },
                  {
                    'stuname': '颜如玉',
                    'time': '2017-4-16 17:33',
                    'rate': '4.3',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  },
                  {
                    'stuname': '阿珂',
                    'time': '2017-4-16 15:53',
                    'rate': '4.3',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  },
                  {
                    'stuname': '亚瑟',
                    'time': '2017-4-16 15:50',
                    'rate': '',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  }
                ]
              },
              {
                'time': '2017-5-12 14:11',
                'progress': '6/22/30',
                'stu': [
                  {
                    'stuname': '林玉',
                    'time': '2017-5-12 15:33',
                    'question': '共产党宣言包含哪些内容？',
                    'rate': '7.3',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  },
                  {
                    'stuname': '何鑫',
                    'time': '2017-5-12 15:33',
                    'rate': '8.3',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  },
                  {
                    'stuname': '杨成才',
                    'time': '2017-5-12 16:33',
                    'rate': '4.3',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  },
                  {
                    'stuname': '颜如玉',
                    'time': '2017-5-12 17:33',
                    'rate': '4.3',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  },
                  {
                    'stuname': '阿珂',
                    'time': '2017-5-12 15:53',
                    'rate': '',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  },
                  {
                    'stuname': '亚瑟',
                    'time': '2017-5-12 15:50',
                    'rate': '4.6',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  }
                ]
              }
            ]
          },
          {
            'classname': '共产党宣言',
            'class': '1-221',
            'day': [
              {
                'time': '2017-6-12 14:11',
                'progress': '6/22/30',
                'stu': [
                  {
                    'stuname': '林玉',
                    'time': '2017-6-12 15:33',
                    'rate': '4.3',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  },
                  {
                    'stuname': '何鑫',
                    'time': '2017-6-12 15:33',
                    'rate': '6.3',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  },
                  {
                    'stuname': '杨成才',
                    'time': '2017-6-12 16:33',
                    'rate': '4.3',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  },
                  {
                    'stuname': '颜如玉',
                    'time': '2017-6-12 17:33',
                    'rate': '',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  },
                  {
                    'stuname': '阿珂',
                    'time': '2017-6-12 15:53',
                    'rate': '4.3',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  },
                  {
                    'stuname': '亚瑟',
                    'time': '2017-6-12 15:50',
                    'rate': '4.9',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  }
                ]
              },
              {
                'time': '2017-4-12 14:11',
                'progress': '6/22/30',
                'stu': [
                  {
                    'stuname': '林玉',
                    'time': '2017-4-12 15:33',
                    'rate': '8.3',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  },
                  {
                    'stuname': '何鑫',
                    'time': '2017-4-12 15:33',
                    'rate': '4.3',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  },
                  {
                    'stuname': '杨成才',
                    'time': '2017-4-12 16:33',
                    'rate': '4.3',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  },
                  {
                    'stuname': '颜如玉',
                    'time': '2017-4-12 17:33',
                    'rate': '',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  },
                  {
                    'stuname': '阿珂',
                    'time': '2017-4-12 15:53',
                    'rate': '4.3',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  },
                  {
                    'stuname': '亚瑟',
                    'time': '2017-4-12 15:50',
                    'rate': '4.3',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  }
                ]
              },
              {
                'time': '2017-4-12 14:11',
                'progress': '6/22/30',
                'stu': [
                  {
                    'stuname': '林玉',
                    'time': '2017-4-12 15:33',
                    'rate': '',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  },
                  {
                    'stuname': '何鑫',
                    'time': '2017-4-12 15:33',
                    'rate': '4.3',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  },
                  {
                    'stuname': '杨成才',
                    'time': '2017-4-12 16:33',
                    'rate': '4.3',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  },
                  {
                    'stuname': '颜如玉',
                    'time': '2017-4-12 17:33',
                    'rate': '4.3',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  },
                  {
                    'stuname': '阿珂',
                    'time': '2017-4-12 15:53',
                    'rate': '4.3',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  },
                  {
                    'stuname': '亚瑟',
                    'time': '2017-4-12 15:50',
                    'rate': '4.3',
                    'question': '共产党宣言包含哪些内容？',
                    'answer': '《共产党宣言》第一次阐述了科学社会主义理论，指出共产主义运动已成为不可抗拒的历史潮流。构成《宣言》核心的基本原理是：每一历史时代主要的生产方式与交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，历史才能得到说明。从原始社会解体以来人类社会的全部历史都是阶级斗争的历史；这个历史包括一系列发展阶段，已经达到这样一个阶段，即无产阶级如果不同时使整个社会摆脱任何剥削、压迫以及阶级划分和阶级斗争，就不能使自己从资产阶级的剥削统治下解放出来。'
                  }
                ]
              }
            ]
          }
        ]
      }
    },
    created(){
      document.body.style.backgroundColor = 'white'
      if (this.$parent.identity === 's') {
        this.time = this.linework[this.$route.query.index1].time[this.$route.query.index2]
      } else {
        this.time = this.tlinework[this.$route.query.index1].day[this.$route.query.index2].stu[this.$route.query.index3]
      }
    },
    mounted(){
      document.getElementById('text-answer').focus()
    },
    methods: {
      workback(name, index1, index2){
        this.$router.push({
          path: name,
          query: {index1: index1, index2: index2}
        })
      }
    }
  }
</script>

<style lang="stylus" type="text/stylus">
  @import '../common/css/leavelist.styl'
  .workdetail
    .workdetail-question
      font-size 22px
      line-height 28px
      font-weight 700
      width 84%
      margin 40px auto 0
    .workdetail-answer
      line-height 22px
      width 84%
      min-height 240px
      padding 4px 2%
      font-size 16px
      margin 34px 6% 0
      display inline-block
    .workdetail-evaluate
      width 84%
      margin 20px auto 0

  .workdetail-color
    color red
    font-size 20px

  .workdetail-sub
    display block
    margin 20px auto
    width 84%
    height 40px
    font-size 22px
    line-height 40px
    border-radius 5px
    text-align center

</style>
